---
kind: property
id: P:Autodesk.Revit.DB.Visual.Gradient.GradientNoisePhase
source: html/14e80223-2d6a-90c6-e8be-dedcf58a94d6.htm
---
# Autodesk.Revit.DB.Visual.Gradient.GradientNoisePhase Property

The property labeled "Phase" from the "Gradient" schema.

## Syntax (C#)
```csharp
public static string GradientNoisePhase { get; }
```

## Remarks
This property is of type "AssetPropertyDouble" within the range of "0, 1000000000".